--- a/README.md
+++ b/README.md
@@ -1,21 +1,47 @@
 # Behance-Like Website Block Scheme
 
 
-@startuml
-[Goldilocks] --> B[Porridge];
-B --> C[Too hot];
-B --> D[Too cold];
-B --> E[Just right];
+## The Goldilocks Decision Tree
 
-[Goldilocks] --> F[Chairs];
+```mermaid
+
+flowchart TD
+
+
+A[Goldilocks] --> B[Porridge];
+
+
+B - -> C[Too hot];
+B - -> D[Too cold];
+
+
+B --› E[Just right];
+
+
+E …> F［Chairs］；
+
+
 F --> G[Too big];
+
+
 F --> H[Still too big];
-F --> I[Just right];
 
-[Just right] --> J[Beds];
-J --> K[Too hard];
-J --> L[Too soft];
-J --> M[Just right];
 
-M --> N[Bears];
-@enduml
+F +-> IJust right];
+
+
+I -> J［Beds］；
+
+
+3 --> K[Too hard];
+
+
+] -> L[Too soft];
+
+
+3 --> M[Just right];
+
+
+M --> N［Bears］；
+
+```
